tutorials/20SteadyBBHeatFluxTurb/0/OLD2/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.00001 0 0);

boundaryField
{
    //inlet
    //{
    //    type            fixedValue;
    //    value           uniform (0.1192 0 0);
    //}
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type             fixedValue;
        value           nonuniform List<vector> 
100
(
(	0.00520095	-2.23E-06	0	)
(	0.0155698	-1.03E-05	0	)
(	0.0260314	-1.95E-05	0	)
(	0.0364993	-2.89E-05	0	)
(	0.0468447	-3.87E-05	0	)
(	0.0568951	-4.90E-05	0	)
(	0.0664422	-6.00E-05	0	)
(	0.0752844	-7.17E-05	0	)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
   lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

 lowerWallHeatFlux
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
