tutorials/20SteadyBBHeatFluxTurb/0/OLD2/UFull
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "9171";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
115600
(
(0.00653181 -0.00184551 0)
(0.00745839 -3.61206e-05 0)
(0.00796514 1.46194e-06 0)
(0.00828582 1.33473e-06 0)
(0.00852942 6.48726e-07 0)
(0.00868689 1.00301e-06 0)
(0.00875845 1.18694e-06 0)
(0.00877034 1.12467e-06 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
100
(
(0.00520095 -2.23e-06 0)
(0.0155698 -1.03e-05 0)
(0.0260314 -1.95e-05 0)
(0.0364993 -2.89e-05 0)
(0.0468447 -3.87e-05 0)
(0.0568951 -4.9e-05 0)
(0.0664422 -6e-05 0)
(0.0752844 -7.17e-05 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWallHeatFlux
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
