tutorials/20SteadyBBHeatFluxTurb/0/OLD2/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
606
(
(-6.00919e-08 5.78941e-07 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
306
(
(-5.98733e-08 -5.7751e-07 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
(-5.95011e-08 0 0)
...
)
;
    }
    lowerWallHeatFlux
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(-7.13503e-08 9.89575e-09 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
(-7.13503e-08 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
