tutorials/20SteadyBBHeatFluxTurb/0/OLD2/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
606
(
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
306
(
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
0.0409956
...
)
;
    }
    lowerWallHeatFlux
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.0374371
0.0374371
0.0374371
0.0374371
0.0374371
0.0374371
0.0374371
0.0374371
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
