tutorials/20SteadyBBHeatFluxTurb/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "17152";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
115600
(
(0.0065258 -0.00184359 0)
(0.00744739 -3.61051e-05 0)
(0.00795842 1.29105e-06 0)
(0.00828825 1.22865e-06 0)
(0.00853795 6.2598e-07 0)
(0.00869631 1.04722e-06 0)
(0.00876469 1.24644e-06 0)
(0.00877257 1.17717e-06 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
100
(
(0.00520095 -2.23e-06 0)
(0.0155698 -1.03e-05 0)
(0.0260314 -1.95e-05 0)
(0.0364993 -2.89e-05 0)
(0.0468447 -3.87e-05 0)
(0.0568951 -4.9e-05 0)
(0.0664422 -6e-05 0)
(0.0752844 -7.17e-05 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWallHeatFlux
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
