tutorials/20SteadyBBHeatFluxTurb/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    upperWall
    {
        type            calculated;
        value           uniform 0; 
    }

    lowerWall
    {
        type            calculated;
        value           uniform 0; 
    }
    lowerWallHeatFlux
    {
        type            calculated;
        value           uniform 0; 
    }
    inlet
    {
        type            calculated;
        value           uniform 0; 
    }
    outlet
    {
        
	type            calculated;
        value           uniform 0; 
    }


    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
