tutorials/20SteadyBBHeatFluxTurb/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    transportModel  Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 5.96e-07;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 2.5644e-04;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 423.15;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 0.0088;

// Turbulent Prandtl number
Prt              [0 0 0 0 0 0 0] 0.9;
    
// ************************************************************************* //
