tutorials/20SteadyBBHeatFluxTurb/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 10;
NmodesUproj 4;

NmodesPout 10;
NmodesPproj 0;

NmodesPrghout 10;
NmodesPrghproj 4;

NmodesSUPout 10;
NmodesSUPproj 0;

NmodesTout 10;
NmodesTproj 4;

NmodesNUTproj 7;

NmodesKproj 3;

NmodesOut 10;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-5;
maxIter 10000;

bcMethod penalty;

RBFradius 0.0026;


