tutorials/20SteadyBBHeatFluxTurb/system/blockMeshDict
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}
convertToMeters 0.05;
vertices
(
    (0 0 -0.5)
    (0 1 -0.5)
    (4 -1 -0.5)
    (4 0 -0.5)
    (4 1 -0.5)
    (24 -1 -0.5)
    (24 0 -0.5)
    (24 1 -0.5)
    (44 -1 -0.5)
    (44 0 -0.5)
    (44 1 -0.5)

    (0 0 0.5)
    (0 1 0.5)
    (4 -1 0.5)
    (4 0 0.5)
    (4 1 0.5)
    (24 -1 0.5)
    (24 0 0.5)
    (24 1 0.5)
    (44 -1 0.5)
    (44 0 0.5)
    (44 1 0.5)
);


blocks
(
    hex (0 3 4 1 11 14 15 12) //y1X1
    (56 100 1) // (56 100 1)
    simpleGrading 
    (
	1
	( 	
		(0.5 0.5 5)
		(0.5 0.5 0.2) 
 	)
	1
    )
    //simpleGrading (1 0.2 1)

    hex (2 5 6 3 13 16 17 14) //y2X2
    (400 100 1) //(400 100 1)
    simpleGrading 
    (
	( 	
		(0.1 0.25 5)
		(0.8 0.5 1) 
		(0.1 0.25 0.2) 
 	)
	( 	
		(0.5 0.6 5)
		(0.5 0.4 0.5) 
 	)
	1
    )
    //simpleGrading (1 5 1)

    hex (3 6 7 4 14 17 18 15) //Y1X2
    (400 100 1)
    simpleGrading 
    (
	( 	
		(0.1 0.25 5)
		(0.8 0.5 1) 
		(0.1 0.25 0.2) 
 	)
	( 	
		(0.5 0.5 5)
		(0.5 0.5 0.2) 
 	)
	1
    )
    //simpleGrading (1 0.2 1)

    hex (5 8 9 6 16 19 20 17) //Y2X3
    (150 100 1) //  (150 100 1)
    simpleGrading 
    (
	( 	
		(0.1 0.25 10)
		(0.9 0.75 1) 
 	)
	( 	
		(0.5 0.6 5)
		(0.5 0.4 0.5) 
 	)
	1
    )
    //simpleGrading (1 5 1)

    hex (6 9 10 7 17 20 21 18) //Y1X3
    (150 100 1)
    simpleGrading 
    (
	(
		(0.1 0.25 10)
		(0.9 0.75 1) 
	)
	( 	
		(0.5 0.5 5)
		(0.5 0.5 0.2) 
 	)
	1
    )
    //simpleGrading (1 0.2 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 12 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 15 12)
            (4 7 18 15)
            (7 10 21 18)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 14 11)
            (3 2 13 14)
            (5 8 19 16)
        );
    }

    lowerWallHeatFlux
    {
        type wall;
        faces
        (
            (2 5 16 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (5 8 9 6)
            (6 9 10 7)
            (11 14 15 12)
            (13 16 17 14)
            (14 17 18 15)
            (16 19 20 17)
            (17 20 21 18)
        );
    }
);


