tutorials/20SteadyBBHeatFluxTurb/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100000;

deltaT          1;

writeControl    timeStep;

writeInterval   50000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

/*functions {
//#includeFunc  flowRatePatch(name=outlet,uRec)
//#includeFunc  patchAverage(name=inlet,p)
//#includeFunc  patchAverage(name=inlet,TRec)
#includeFunc  singleGraphX3
#includeFunc  singleGraphX6
#includeFunc  singleGraphX9
#includeFunc  singleGraphX12
#includeFunc  singleGraphX15
#includeFunc  singleGraphX18
#includeFunc  singleGraphX21
#includeFunc  singleGraphX24
#includeFunc  singleGraphX27
#includeFunc  singleGraphX30
#includeFunc  singleGraphLHW
}*/



// ************************************************************************* //
