tutorials/20SteadyBBHeatFluxTurb/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   8;

method               scotch;

simpleCoeffs
{
    n                    (2 4 1);
    delta                0.001;
}

hierarchicalCoeffs
{
    n                    (2 4 1);
    delta                0.001;
    order                yxz;
}

metisCoeffs
{
    processorWeights 
    (
        1
        1
        1
    );
}

manualCoeffs
{
    dataFile             "decompositionData";
}

// ************************************************************************* //
