tutorials/20SteadyBBHeatFluxTurb/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    /*p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.1;
        smoother         GaussSeidel;
    }*/

    p
    {

	solver          smoothSolver;
    	smoother        DILU;
    	tolerance       1e-50;
    	maxIter         10;

        //solver          PCG;
        //preconditioner  DIC;
        //tolerance       1e-06;
        //relTol          0.01;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-6;
        relTol           0.01;
    }

    /*pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.01;
    }*/

    "(U|k|epsilon|omega|f|v2|nuTilda|h|T)"
    {
	/*solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5; //1e-7
        relTol          0.1;*/

	solver          smoothSolver;
    	smoother        DILU;
    	tolerance       1e-50;
    	maxIter         10;
    }

  /*  "(U|k|epsilon|omega|f|v2|nuTilda|h|T)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0.1;
    }*/
    Phi
    {
        $p;
    }

    Usup
    {
        type            coupled;  // optional, defaults to segregated
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-06 1e-06 1e-06);
        relTol          (0 0 0);
    }
}


potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0.0;
}


cache
{
    grad(U);
}

PIMPLE
{
    //correctPhi          yes;
    momentumPredictor no;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0.0;
}


SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0.0;

    residualControl
    {
        p_rgh           1e-5; //1e-2;
        U               1e-5;
	T           	1e-5;
        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{
  
        p_rgh           0.3;   //0.3
    	U               0.7; //0.7
    	T               0.7; //0.7
    	"(k|epsilon|omega|R)" 0.7; //0.7
}



// ************************************************************************* //
