tutorials/20SteadyBBHeatFluxTurb/system/patchAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/

name    inlet;
fields  (TRec);

operation areaAverage;
#includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"

// ************************************************************************* //
